NCTU-AUV/SAUVC-STM32/Custom/Inc/motor_pwm_control_driver.h
#ifndef MOTOR_PWM_CONTROL_DRIVER
#define MOTOR_PWM_CONTROL_DRIVER

#include "stm32f4xx_hal.h"

#include <stdint.h>
#include <stdbool.h>

typedef enum {
    MOTOR0 = 0,
    MOTOR1 = 1,
    MOTOR2 = 2,
    MOTOR3 = 3,
    MOTOR4 = 4,
    MOTOR5 = 5,
    MOTOR6 = 6,
    MOTOR7 = 7,
} MotorNumber;

void initialize_all_motors(
    TIM_HandleTypeDef *motor_0_htim,
    uint32_t motor_0_channel,

    TIM_HandleTypeDef *motor_1_htim,
    uint32_t motor_1_channel,

    TIM_HandleTypeDef *motor_2_htim,
    uint32_t motor_2_channel,

    TIM_HandleTypeDef *motor_3_htim,
    uint32_t motor_3_channel,

    TIM_HandleTypeDef *motor_4_htim,
    uint32_t motor_4_channel,

    TIM_HandleTypeDef *motor_5_htim,
    uint32_t motor_5_channel,

    TIM_HandleTypeDef *motor_6_htim,
    uint32_t motor_6_channel,

    TIM_HandleTypeDef *motor_7_htim,
    uint32_t motor_7_channel
);

void set_motor_pwm_output(MotorNumber motor_number, uint32_t output_signal_value_us);

void start_motor_pwm_output(MotorNumber motor_number);
void stop_motor_pwm_output(MotorNumber motor_number);

void start_all_motors_pwm_output();
void stop_all_motors_pwm_output();

bool is_pwm_output_on(MotorNumber motor_number);
uint32_t get_pwm_output_signal_value_us(MotorNumber motor_number);

#endif